from math import e, factorial

# Вероятность того, что стрелок попадет в мишень, выстрелив один раз,
# равна 0.8.Стрелок выстрелил 100 раз. Найдите вероятность того,
# что стрелок попадет в цель ровно 85 раз.


def combination(n, k):
    return factorial(n)/(factorial(n - k) * factorial(k))
n_1 = 100
k = 85
p_1 = 0.8
q_1 = 0.2

comb = combination(100, 85)

solution = comb * p_1 ** k * q_1 ** (n_1 -k)
print(solution)

# Вероятность того, что лампочка перегорит в течение первого дня эксплуатации,
# равна 0.0004. В жилом комплексе после ремонта в один день включили 5000
# новых лампочек. Какова вероятность, что ни одна из них
# не перегорит в первый день? Какова вероятность, что перегорят ровно две?

n_2 = 5000
p_2 = 0.0004
k_1 = 0
k_2 = 2

task_1 = ((n_2 * p_2)**k_1 / factorial(k_1)) * e ** -(n_2 * p_2)
print(task_1)
task_2 = ((n_2*p_2)**k_2 / factorial(k_2)) * e ** -(n_2 * p_2)
print(task_2)


#  Монету подбросили 144 раза. Какова вероятность,
#  что орел выпадет ровно 70 раз?
n = 144
m = 70
p = 0.5
q = 0.5
comb_3 = combination(144, 70)

solution_3 = comb_3 * p ** m * q ** (n - m)
print(solution_3)


# В первом ящике находится 10 мячей, из которых 7 - белые.
# Во втором ящике - 11 мячей, из которых 9 белых.
# Из каждого ящика вытаскивают случайным образом по два мяча.
# Какова вероятность того, что все мячи белые? Какова вероятность того,
# что ровно два мяча белые? Какова вероятность того, что хотя бы один мяч белый?

