# Случайная непрерывная величина A имеет равномерное распределение
# на промежутке (200, 800].
# Найдите ее среднее значение и дисперсию.

a = 200
b = 800

M = (b - a) / 2
o = (b - a) ** 2 / 12
print(f"Математическое ожидание равно {M}, дисперсия равна {o}")

# О случайной непрерывной равномерно распределенной величине B известно,
# что ее дисперсия равна 0.2. Можно ли найти правую границу величины B
# и ее среднее значение зная, что левая граница равна 0.5?
# Если да, найдите ее.

D = 0.2
a = 0.5
# по формуле
# D = (b - a) ** 2 / 12
# D = (b - 0.5) / 12
# 2.4 = b**2 - b + 0.25
# решаем квадратное уравнение
# b ** 2 - b - 2,15 = 0
d = (-1) ** 2 - 4 * 1 * (-2.15)
b_1 = round((1 + d ** 0.5) / 2, 2)
b_2 = round((1 - d ** 0.5) / 2, 2)
print(b_1, b_2)
# проверка
D_1 = (b_1 - a) ** 2 / 12
print(round(D_1, 2))
# по условию подходит только в_1 - правая часть не может быть больше левой
M = (a + b_1) / 2
print(f"Правая граница интервала {b_1} , математическое ожидание {M}")

# На сколько сигм (средних квадратичных отклонений) отклоняется рост человека,
# равный 190 см, от математического ожидания роста в популяции,
# в которой M(X) = 178 см и D(X) = 25 кв.см?

D = 25
o = D ** 0.5
count_o = (190 - 178) / o
print(f"Рост 190 см отклоняется от математического ожидания 178 см"
      f" на {count_o} сигмы")



